# Import Libararies

In [4]:
import pandas as pd
import matplotlib.pyplot as plt

# Create New Data

In [1]:
d={'Name':['Abdi','Mohamed','Ali','Wazira'],
    'Age':[20,25,30,15],
   'Gender':['Male','Male','Male','Female'],
   'Married':['Yes','No','No','Yes']
  }

In [8]:
dff=pd.DataFrame(d,columns=['Name','Age','Gender','Married'])

In [9]:
dff

      Name  Age  Gender Married
0     Abdi   20    Male     Yes
1  Mohamed   25    Male      No
2      Ali   30    Male      No
3   Wazira   15  Female     Yes

In [11]:
dff.shape

(4, 4)

In [12]:
dff.columns

Index(['Name', 'Age', 'Gender', 'Married'], dtype='object')

In [13]:
dff.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     4 non-null      object
 1   Age      4 non-null      int64
 2   Gender   4 non-null      object
 3   Married  4 non-null      object
dtypes: int64(1), object(3)
memory usage: 260.0+ bytes

In [14]:
dff.describe()

             Age
count   4.000000
mean   22.500000
std     6.454972
min    15.000000
25%    18.750000
50%    22.500000
75%    26.250000
max    30.000000

In [17]:
dff.dtypes

Name       object
Age         int64
Gender     object
Married    object
dtype: object

In [20]:
dff['Level']='Graduate','Graduate','Graduate','Graduate'

In [22]:
dff.drop('Level',axis=1,inplace=True)

In [23]:
dff

      Name  Age  Gender Married  Experience
0     Abdi   20    Male     Yes          20
1  Mohamed   25    Male      No          25
2      Ali   30    Male      No          30
3   Wazira   15  Female     Yes          15

In [13]:
data

{'Name': ['Hassan Ali', 'Jama Ahmed', 'Fatima Ali'],
 'Age': [34, 25, 21],
 'Gender': ['Male', 'Male', 'Female'],
 'Maried': ['Yes', 'No', 'Yes']}

In [14]:
df=pd.DataFrame(data,columns=['Name','Age','Gender','Maried'])

In [15]:
dff

         Name  Age  Gender Maried
0  Hassan Ali   34    Male    Yes
1  Jama Ahmed   25    Male     No
2  Fatima Ali   21  Female    Yes

# Rows and Columns

In [16]:
df.shape

(3, 4)

# Data Info

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
 3   Maried  3 non-null      object
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

# Data Types

In [18]:
df.dtypes

Name      object
Age        int64
Gender    object
Maried    object
dtype: object

# Statistical Info

In [19]:
df.describe()

             Age
count   3.000000
mean   26.666667
std     6.658328
min    21.000000
25%    23.000000
50%    25.000000
75%    29.500000
max    34.000000

In [20]:
data2={'Name':['Hassan Ali','Jama Ahmed','Fatima Ali'],
     'Statistics':[34,25,21],
     'Python':[78,80,60],
     'Arabic':[34,54,97]
       
}

In [21]:
df1=pd.DataFrame(data2,columns=['Name','Statistics','Python','Arabic'])

In [22]:
df1

         Name  Statistics  Python  Arabic
0  Hassan Ali          34      78      34
1  Jama Ahmed          25      80      54
2  Fatima Ali          21      60      97

In [23]:
df1.dtypes

Name          object
Statistics     int64
Python         int64
Arabic         int64
dtype: object

In [24]:
df1.describe()

       Statistics     Python     Arabic
count    3.000000   3.000000   3.000000
mean    26.666667  72.666667  61.666667
std      6.658328  11.015141  32.192132
min     21.000000  60.000000  34.000000
25%     23.000000  69.000000  44.000000
50%     25.000000  78.000000  54.000000
75%     29.500000  79.000000  75.500000
max     34.000000  80.000000  97.000000

In [25]:
df1

         Name  Statistics  Python  Arabic
0  Hassan Ali          34      78      34
1  Jama Ahmed          25      80      54
2  Fatima Ali          21      60      97

# Adding New Column

In [26]:
df1['Total']=df1['Statistics']+df1['Python']+df1['Arabic']

In [27]:
df1

         Name  Statistics  Python  Arabic  Total
0  Hassan Ali          34      78      34    146
1  Jama Ahmed          25      80      54    159
2  Fatima Ali          21      60      97    178

In [28]:
df1['Average']=df1['Total']/3

In [29]:
df1

         Name  Statistics  Python  Arabic  Total    Average
0  Hassan Ali          34      78      34    146  48.666667
1  Jama Ahmed          25      80      54    159  53.000000
2  Fatima Ali          21      60      97    178  59.333333

# Delete Column

In [30]:
df1.drop('Average',axis=1,inplace=True)

In [31]:
df1

         Name  Statistics  Python  Arabic  Total
0  Hassan Ali          34      78      34    146
1  Jama Ahmed          25      80      54    159
2  Fatima Ali          21      60      97    178